#include "Date.h"

/*7. Визначити клас "Дата" для роботи із датами в межах року.
Членами класу є число, місяць та рік.
Реалізувати для нього декілька конструкторів, геттери, метод визначення пори року, що відповідає вказаній даті.
Перевантажити оператори : "+=" для збільшення дати на вказану кількість днів, "-" - для знаходження інтервалу між двома датами.
Створити три об'єкта-дати (D1, D2, D3), використовуючи різні конструктори.
Збільшити дату D1 на 9 днів, а дату D2 на 14 днів.
Визначити тривалість інтервалу між датами D1 і D2.
Для дати D3 визначити пору року, якій відповідає ця дата.*/

int main()
{
	SetConsoleOutputCP(1251);
	SetConsoleCP(1251);

	Date D1, D2(1, 1, 2000), D3(D2);
	char flag;
	D1.fill();
	cout << "Поточна дата D2: " << D2.stringDate() << ". Ви хочете змінити її? (т/н) "; cin >> flag;
	if (flag == 'т' || flag == 'Т') D2.fill();
	cout << "=========================================================" << endl;
	cout << "Тепер створимо ідентичну дату D3, скопіювавши D2" << endl; 
	cout << "D3: " << D3.stringDate() << endl;
	cout << "Пора року D3: " << D3.getSeason() << endl;
	cout << "=========================================================" << endl;
	cout << "Збільшивши дату D1 на 9 днів, а D2 на 14 днів, отримаємо такі дати:" << endl;
	D1 += 9; D2 += 14;
	cout << "D1: " << D1.stringDate() << " D2: " << D2.stringDate() << endl;
	cout << "=========================================================" << endl;
	cout << "Отже, інтервал між D1 та D2 буде " << abs(D1 - D2) << " днів" << endl;
	
}